senserf/picos/PicOS/CC13XX/TENTATIVE/rfprop_broken.c
		if (tcvphy_isurgent ((address)the_packet) &&
		    (cmd_ta . pPkt = (byte*) umalloc (cmd_ta . pktLen =
			paylen + 1)) != NULL) {

			// If there's no memory, we just ignore the urgent
			// status (and try to transmit the packet as a regular
			// one); maybe we should just drop it, but it is
			// easier this way and we cannot do anything more
			// intelligent really

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
			((address)(the_packet)) [1] = bckf_lbt;
#endif
			// Copy the packet
			memcpy (cmd_ta . pPkt + 1, the_packet, paylen);

			// Insert the length
			cmd_ta . pPkt [0] = paylen;

			// The original can now be discarded
			tcvphy_end ((address)the_packet);
			paylen = 0;
			// Make sure the device is ready
			rf_on ();
			rx_de ();
			// Go transmit it as an ADV packet
			goto DR_WURG__;
		}

#endif	/* END WOR */

		// Here we transmit a regular packet. Note that we ignore
		// backoff (and LBT) for a WOR wakeup packet, which makes
		// sense considering how much damage it is going to do

		if (bckf_timer) {
			// Backoff wait
#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
Bkf:
#endif
			wait (qevent, DR_LOOP);
			delay (bckf_timer, DR_LOOP);
			if (dstate & DSTATE_RXAC) {
				// Don't forget about receiving packets instead
				// of sitting on your hands
				if (rx_int_enable ())
					goto DR_LOOP__;
			}
			release;
		}

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
		// Check for CAV requested in the packet
		ppm = (address)(the_packet + paylen);
		if ((pcav = (*ppm) & 0x0fff)) {
			// Remove for subsequent turns
			*ppm &= ~0x0fff;
			utimer_set (bckf_timer, pcav);
			goto Bkf;
		}
#endif
		// Make sure the device is ready
		rf_on ();
		rx_de ();

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
		// Set the transmit power according to what the packet requests
		if ((pcav = patable [(*ppm >> 12) & 0x7]) !=
		    RF_cmdPropRadioDivSetup.txPower) {
			// Need to change
		    	RF_cmdPropRadioDivSetup.txPower = 
				cmd_sp.txPower = pcav;
			issue_cmd ((lword)&cmd_sp);
		}
#endif

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
		// The obscure optional report (for tests only)
		((address)(the_packet)) [1] = bckf_lbt;
#endif
		// Lock the packet
		_BIS (dstate, DSTATE_TXIP);

#if RADIO_LBT_SENSE_TIME > 0

// ============================================================================
// LBT ON =====================================================================
// ============================================================================

#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
		if (*ppm & 0x8000) {
			// LBT off requested by packet
			txtries = RADIO_LBT_MAX_TRIES;
			proceed (DR_FRCE);
		}
#endif
		cmd_cs . status = RF_cmdPropTx . status = 0;
		// Carrier sense + transmit if OK
		issue_cmd ((lword)&cmd_cs);

	entry (DR_XMIT)

		if (dstate & DSTATE_IRST)
			goto DR_LOOP__;

		wait (txevent, DR_XMIT);
		enable_event (txevent);
		if ((cmd_cs.status & 0x3000) != 0x3000)
			// Wait for command completion
			release;

		// Check the CS status
		if (cmd_cs.status == PROP_DONE_BUSY || 
		    cmd_cs.status == PROP_DONE_BUSYTIMEOUT) {
			// Carrier sense failed
			if (txtries >= RADIO_LBT_MAX_TRIES)
				// Forced TX, no CS
				proceed (DR_FRCE);
			txtries++;
			// Backoff
			// diag ("BUSY");
			gbackoff_lbt;
			update_bckf_lbt (bckf_timer);
			goto DR_LOOP__;
		}
TXEnd:
		// Release the packet
		tcvphy_end ((address)the_packet);
		paylen = 0;

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
		bckf_lbt = 0;
#endif

#if RADIO_LBT_SENSE_TIME > 0
		txtries = 0;
#endif

#if RADIO_WOR_MODE
TXFin:
#endif
		LEDI (1, 0);
		gbackoff_xmt;
		// If we don't care to delay after xmt, then perhaps we
		// should send whatever pending packets we have in the queue
		// without restarting the receiver
		goto DR_LOOP__;

	entry (DR_FRCE)

		// Transmit without LBT
		RF_cmdPropTx . status = 0;
		issue_cmd ((lword)&RF_cmdPropTx);

	entry (DR_FXMT)

		if (dstate & DSTATE_IRST)
			goto DR_LOOP__;

		wait (txevent, DR_FXMT);
		enable_event (txevent);
		if ((RF_cmdPropTx.status & 0x3000) != 0x3000)
			// Wait for command completion
			release;

		// Check the CS status
		if (RF_cmdPropTx.status == PROP_DONE_OK)
			goto TXEnd;

		// Something wrong
		delay (1, DR_LOOP);
		release;

#else	/* RADIO_LBT_SENSE_TIME */

// ============================================================================
// LBT OFF ====================================================================
// ============================================================================

		RF_cmdPropTx . status = 0;
		issue_cmd ((lword)&RF_cmdPropTx);

	entry (DR_XMIT)

		if (dstate & DSTATE_IRST)
			goto DR_LOOP__;

		wait (txevent, DR_XMIT);
		enable_event (txevent);
		if ((RF_cmdPropTx.status & 0x3000) != 0x3000)
			// Wait for command completion
			release;

		// Check the CS status
		if (RF_cmdPropTx.status != PROP_DONE_OK) {
			// Something wrong
			delay (1, DR_LOOP);
			release;
		}

		// Release the packet
		tcvphy_end ((address)the_packet);
		paylen = 0;

#if (RADIO_OPTIONS & RADIO_OPTION_RBKF)
		bckf_lbt = 0;
#endif

#if RADIO_LBT_SENSE_TIME > 0
		txtries = 0;
#endif

#if RADIO_WOR_MODE
TXFin:
#endif
		LEDI (1, 0);
		gbackoff_xmt;
		goto DR_LOOP__;

#endif	/* RADIO_LBT_SENSE_TIME */

// ============================================================================
// END LBT ====================================================================
// ============================================================================

	entry (DR_GOOF)

		// Inactivity timeout with RX OFF
		if (!(dstate & DSTATE_IRST) && (dstate & DSTATE_RXON) == 0 &&
		    tcvphy_top (physid) == NULL)
			rf_off ();

		goto DR_LOOP__;

#if RADIO_WOR_MODE

	entry (DR_WRES)

		// Resume WOR after temporary suspension
		_BIC (dstate, DSTATE_WORS);
		goto DR_LOOP__;

	entry (DR_WURG)

DR_WURG__:
		// Transmit an urgent packet (WOR wakeup)
		cmd_ta . status = 0;
		issue_cmd ((lword)&cmd_ta);

	entry (DR_WXMT)

		// Wait for the end of an urgent transmission (WOR wakeup)
		if ((dstate & DSTATE_IRST) == 0) {

