senserf/picos/PicOS/CC13XX/TENTATIVE/rfprop_broken.c
#if (RADIO_OPTIONS & RADIO_OPTION_NOCHECKS) == 0
	if (rbuffl != 0)
		/* We are allowed to do it only once */
		syserror (ETOOMANY, "cc13");
#endif
	if (mbs == 0)
		mbs = CC1350_MAXPLEN;

#if (RADIO_OPTIONS & RADIO_OPTION_NOCHECKS) == 0
	if (mbs < 6 || mbs > CC1350_MAXPLEN)
		syserror (EREQPAR, "cc13 mb");
#endif

	rbuffl = (byte) mbs;

	// Allocate the receive pool
	init_rbuffs ();

	physid = phy;

	// Register the phy
	qevent = tcvphy_reg (phy, option, INFO_PHYS_CC1350);

	LEDI (0, 0);
	LEDI (1, 0);
	LEDI (2, 0);

#if DIAG_MESSAGES
	diag ("CC1350: %u, %u, %u", RADIO_BITRATE_INDEX, RADIO_DEFAULT_POWER,
		RADIO_DEFAULT_CHANNEL);
#endif
	// Install the backoff timer
	utimer_add (&bckf_timer);

#if RADIO_SYSTEM_IDENT
	// Zero means use the value produced by SmartStudio
	RF_cmdPropRx . syncWord = RF_cmdPropTx . syncWord = RADIO_SYSTEM_IDENT;
#endif
	// Start the driver process
	drvprcs = runthread (cc1350_driver);

#if (RADIO_OPTIONS & RADIO_OPTION_NOCHECKS) == 0
	if (drvprcs == 0)
		syserror (ERESOURCE, "cc13");
#endif
	// Preset the power, rate, and channel

#if RADIO_DEFAULT_POWER <= 7
#if (RADIO_OPTIONS & RADIO_OPTION_PXOPTIONS)
	cmd_sp.txPower =
#endif
	RF_cmdPropRadioDivSetup.txPower =
		patable [txpower = RADIO_DEFAULT_POWER];
#endif

#if RADIO_BITRATE_INDEX > 0
	plugrt ();
#endif
	plugch ();

	// Make sure prop mode is selected in PRCM (this is supposed to be
	// the default)
	HWREG (PRCM_BASE + PRCM_O_RFCMODESEL) =  RF_MODE_PROPRIETARY_SUB_1;

	// Precompute the Trim; I used to have the next statement, TIRTOS
	// driver doesn't seem to have it; seems to make no difference, so
	// I'm taking it out (231005)
	// RFCRTrim ((rfc_radioOp_t*)&RF_cmdPropRadioDivSetup);
   	RFCRfTrimRead ((rfc_radioOp_t*)&RF_cmdPropRadioDivSetup,
		(rfTrim_t*)&rfTrim);

	// Direct all doorbell interrupts permanently to CPE0
	HWREG (RFC_DBELL_BASE + RFC_DBELL_O_RFCPEISL) = 0;

#if RADIO_WOR_MODE
	// Assumes that static parts of the RX command are now set
	init_wor ();
#endif
	// Set default parameters
	set_driver_params (NULL);
}

